apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
/**
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <hal/hal_spi.h>

#include <string.h>
#include <errno.h>

#include <hal/hal_spi.h>
#include <bsp/cmsis_nvic.h>
#include <nrf.h>
#include <nrf_spim.h>
#include <nrf_spis.h>
#include <nrf_drv_spi.h>
#include <nrf_drv_spis.h>
#include <nrf_drv_common.h>
#include <app_util_platform.h>

/* XXX:
 * 1) what about stats?
 * 2) Dealing with errors (OVERFLOW, OVERREAD)
 * 3) Dont think I need dummy_rx as I can set master RX maxcnt to zero.
 */

/* The maximum number of SPI interfaces we will allow */
#define NRF52_HAL_SPI_MAX (2)

/* Used to disable all interrupts */
#define NRF_SPI_IRQ_DISABLE_ALL 0xFFFFFFFF

/*
 *  Slave states
 *
 *  IDLE: Slave not ready to be used. If master attempts to access
 *        slave it will receive the default character
 *  ACQ_SEM: Slave is attempting to acquire semaphore.
 *  READY: Slave is ready for master to send it data
 *
 */
#define HAL_SPI_SLAVE_STATE_IDLE        (0)
#define HAL_SPI_SLAVE_STATE_ACQ_SEM     (1)
#define HAL_SPI_SLAVE_STATE_READY       (2)

struct nrf52_hal_spi {
    uint8_t spi_xfr_flag;   /* Master only */
    uint8_t dummy_rx;       /* Master only */
    uint8_t slave_state;    /* Slave only */
    uint8_t slave_buflen;   /* Slave only */
    struct hal_spi_settings spi_cfg; /* Slave and master */
    union {
        nrf_drv_spi_t   spim;
        nrf_drv_spis_t  spis;
    } nhs_spi;

    /* These are slave only */
    uint8_t *slave_txbuf;
    uint8_t *slave_rxbuf;
};

#if SPI0_ENABLED
struct nrf52_hal_spi nrf52_hal_spi0;
#endif
#if SPI1_ENABLED
struct nrf52_hal_spi nrf52_hal_spi1;
#endif

struct nrf52_hal_spi *nrf52_hal_spis[NRF52_HAL_SPI_MAX] = {
#if SPI0_ENABLED
    &nrf52_hal_spi0,
#else
    NULL,
#endif
#if SPI1_ENABLED
    &nrf52_hal_spi1
#else
    NULL
#endif
};

#if SPI0_ENABLED
nrf_drv_spi_t inst_spi0_m = NRF_DRV_SPI_INSTANCE(0);
nrf_drv_spis_t inst_spi0_s = NRF_DRV_SPIS_INSTANCE(0);
#endif
#if SPI1_ENABLED
nrf_drv_spi_t inst_spi1_m = NRF_DRV_SPI_INSTANCE(1);
nrf_drv_spis_t inst_spi1_s = NRF_DRV_SPIS_INSTANCE(1);
#endif

#define NRF52_HAL_SPI_RESOLVE(__n, __v)         \
    if ((__n) >= NRF52_HAL_SPI_MAX) {           \
        rc = EINVAL;                            \
        goto err;                               \
    }                                           \
    (__v) = nrf52_hal_spis[(__n)];              \
    if ((__v) == NULL) {                        \
        rc = EINVAL;                            \
        goto err;                               \
    }

#if (SPI0_ENABLED || SPI1_ENABLED)
static void
nrf52_irqm_handler(struct nrf52_hal_spi *spi)
{
    NRF_SPIM_Type *p_spim;

    /* XXX: what if not in a transfer? */

    p_spim = spi->nhs_spi.spim.p_registers;
    if (nrf_spim_event_check(p_spim, NRF_SPIM_EVENT_END)) {
        nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_END);
        if (spi->spi_cfg.txrx_cb_func) {
            spi->spi_cfg.txrx_cb_func(spi->spi_cfg.txrx_cb_arg,
                                      p_spim->TXD.AMOUNT);
            spi->spi_xfr_flag = 0;
        }
    }
}

/* WWW */
uint32_t SlaveAcqIRQs;
uint32_t SlaveEndIRQs;
uint32_t SlaveReleases;
/* WWW */

static void
nrf52_irqs_handler(struct nrf52_hal_spi *spi)
{
    uint8_t xfr_len;
    NRF_SPIS_Type *p_spis;

    p_spis = spi->nhs_spi.spis.p_reg;

    /* Semaphore acquired event */
    if (nrf_spis_event_check(p_spis, NRF_SPIS_EVENT_ACQUIRED)) {
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_ACQUIRED);

        /* WWW */
        ++SlaveAcqIRQs;
        /* WWW */

        if (spi->slave_state == HAL_SPI_SLAVE_STATE_ACQ_SEM) {
            if (spi->slave_txbuf == NULL) {
                nrf_spis_tx_buffer_set(p_spis, 0, 0);
            } else {
                nrf_spis_tx_buffer_set(p_spis, spi->slave_txbuf, spi->slave_buflen);
            }

            if (spi->slave_rxbuf == NULL) {
                nrf_spis_rx_buffer_set(p_spis, 0, 0);
            } else {
                nrf_spis_rx_buffer_set(p_spis, spi->slave_rxbuf, spi->slave_buflen);
            }
            /* WWW */
            ++SlaveReleases;
            /* WWW */
            nrf_spis_task_trigger(p_spis, NRF_SPIS_TASK_RELEASE);
            spi->slave_state = HAL_SPI_SLAVE_STATE_READY;
        }
    }

    /* SPI transaction complete */
    if (nrf_spis_event_check(p_spis, NRF_SPIS_EVENT_END)) {
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_END);
        /* WWW */
        ++SlaveEndIRQs;
        /* WWW */

        if (spi->slave_state == HAL_SPI_SLAVE_STATE_READY) {
            if (spi->spi_cfg.txrx_cb_func) {
                /* Get transfer length */
                if (spi->slave_txbuf == NULL) {
                    xfr_len = nrf_spis_rx_amount_get(p_spis);
                } else {
                    xfr_len = nrf_spis_tx_amount_get(p_spis);
                }
                spi->spi_cfg.txrx_cb_func(spi->spi_cfg.txrx_cb_arg, xfr_len);
            }
            spi->slave_state = HAL_SPI_SLAVE_STATE_IDLE;
        }
    }

}
#endif

/* Interrupt handlers for SPI ports */
#if SPI0_ENABLED
void
nrf52_spi0_irq_handler(void)
{
    if (nrf52_hal_spi0.spi_cfg.spi_type == HAL_SPI_TYPE_MASTER) {
        nrf52_irqm_handler(&nrf52_hal_spi0);
    } else {
        nrf52_irqs_handler(&nrf52_hal_spi0);
    }
}
#endif

#if SPI1_ENABLED
void
nrf52_spi1_irq_handler(void)
{
    if (nrf52_hal_spi0.spi_cfg.spi_type == HAL_SPI_TYPE_MASTER) {
        nrf52_irqm_handler(&nrf52_hal_spi1);
    } else {
        nrf52_irqs_handler(&nrf52_hal_spi1);
    }
}
#endif

static void
hal_spi_stop_transfer(NRF_SPIM_Type *p_spim)
{
    nrf_spim_task_trigger(p_spim, NRF_SPIM_TASK_STOP);
    while (!nrf_spim_event_check(p_spim, NRF_SPIM_EVENT_STOPPED)) {}
    nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_STOPPED);
}

static int
hal_spi_config_master(struct nrf52_hal_spi *spi,
                      struct hal_spi_settings *settings)
{
    int rc;
    NRF_SPIM_Type *p_spim;
    nrf_spim_frequency_t frequency;
    nrf_spim_mode_t spi_mode;
    nrf_spim_bit_order_t bit_order;

    p_spim = spi->nhs_spi.spim.p_registers;
    memcpy(&spi->spi_cfg, settings, sizeof(*settings));

    /* Only 8-bit word sizes supported. */
    switch (settings->word_size) {
        case HAL_SPI_WORD_SIZE_8BIT:
            break;
        default:
            rc = EINVAL;
            goto err;
    }

    switch (settings->data_mode) {
        case HAL_SPI_MODE0:
            spi_mode = NRF_SPIM_MODE_0;
            break;
        case HAL_SPI_MODE1:
            spi_mode = NRF_SPIM_MODE_1;
            break;
        case HAL_SPI_MODE2:
            spi_mode = NRF_SPIM_MODE_2;
            break;
        case HAL_SPI_MODE3:
            spi_mode = NRF_SPIM_MODE_3;
            break;
        default:
            spi_mode = 0;
            break;
    }

