apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
    switch (settings->data_order) {
        case HAL_SPI_MSB_FIRST:
            bit_order = NRF_SPIM_BIT_ORDER_MSB_FIRST;
            break;
        case HAL_SPI_LSB_FIRST:
            bit_order = NRF_SPIM_BIT_ORDER_LSB_FIRST;
            break;
        default:
            bit_order = 0;
            break;
    }
    nrf_spim_configure(p_spim, spi_mode, bit_order);

    switch (settings->baudrate) {
        case 125:
            frequency = NRF_SPIM_FREQ_125K;
            break;
        case 250:
            frequency = NRF_SPIM_FREQ_250K;
            break;
        case 500:
            frequency = NRF_SPIM_FREQ_500K;
            break;
        case 1000:
            frequency = NRF_SPIM_FREQ_1M;
            break;
        case 2000:
            frequency = NRF_SPIM_FREQ_2M;
            break;
        case 4000:
            frequency = NRF_SPIM_FREQ_4M;
            break;
        case 8000:
            frequency = NRF_SPIM_FREQ_8M;
            break;
        default:
            rc = EINVAL;
            goto err;
    }
    nrf_spim_frequency_set(p_spim, frequency);

    return (0);
err:
    return (rc);
}

static int
hal_spi_config_slave(struct nrf52_hal_spi *spi,
                     struct hal_spi_settings *settings)
{
    int rc;
    NRF_SPIS_Type *p_spis;
    nrf_spis_mode_t spi_mode;
    nrf_spis_bit_order_t bit_order;

    p_spis = spi->nhs_spi.spis.p_reg;

    spi_mode = 0;
    switch (settings->data_mode) {
        case HAL_SPI_MODE0:
            spi_mode = NRF_SPIS_MODE_0;
            break;
        case HAL_SPI_MODE1:
            spi_mode = NRF_SPIS_MODE_1;
            break;
        case HAL_SPI_MODE2:
            spi_mode = NRF_SPIS_MODE_2;
            break;
        case HAL_SPI_MODE3:
            spi_mode = NRF_SPIS_MODE_3;
            break;
    }

    bit_order = 0;
    switch (settings->data_order) {
        case HAL_SPI_MSB_FIRST:
            bit_order = NRF_SPIS_BIT_ORDER_MSB_FIRST;
            break;
        case HAL_SPI_LSB_FIRST:
            bit_order = NRF_SPIS_BIT_ORDER_LSB_FIRST;
            break;
    }
    nrf_spis_configure(p_spis, spi_mode, bit_order);

    /* Only 8-bit word sizes supported. */
    switch (settings->word_size) {
        case HAL_SPI_WORD_SIZE_8BIT:
            break;
        default:
            rc = EINVAL;
            goto err;
    }
    return (0);

err:
    return (rc);
}

static int
hal_spi_init_master(nrf_drv_spi_t *p_instance,
                    nrf_drv_spi_config_t *p_config,
                    nrf_drv_irq_handler_t handler)
{
    uint32_t mosi_pin;
    uint32_t miso_pin;
    NRF_SPIM_Type *p_spim;

#if PERIPHERAL_RESOURCE_SHARING_ENABLED
    if (nrf_drv_common_per_res_acquire(p_instance->p_registers,
                                       handler) != NRF_SUCCESS) {
        return NRF_ERROR_BUSY;
    }
#endif

    /* Configure pins used by the peripheral:
       - SCK - output with initial value corresponding with the SPI mode used:
       0 - for modes 0 and 1 (CPOL = 0), 1 - for modes 2 and 3 (CPOL = 1);
       according to the reference manual guidelines this pin and its input
       buffer must always be connected for the SPI to work.
    */
    if (p_config->mode <= NRF_DRV_SPI_MODE_1) {
        nrf_gpio_pin_clear(p_config->sck_pin);
    } else {
        nrf_gpio_pin_set(p_config->sck_pin);
    }

    NRF_GPIO->PIN_CNF[p_config->sck_pin] =
        (GPIO_PIN_CNF_DIR_Output        << GPIO_PIN_CNF_DIR_Pos)
      | (GPIO_PIN_CNF_INPUT_Connect     << GPIO_PIN_CNF_INPUT_Pos)
      | (GPIO_PIN_CNF_PULL_Disabled     << GPIO_PIN_CNF_PULL_Pos)
      | (GPIO_PIN_CNF_DRIVE_S0S1        << GPIO_PIN_CNF_DRIVE_Pos)
      | (GPIO_PIN_CNF_SENSE_Disabled    << GPIO_PIN_CNF_SENSE_Pos);

    /* - MOSI (optional) - output with initial value 0 */
    if (p_config->mosi_pin != NRF_DRV_SPI_PIN_NOT_USED) {
        mosi_pin = p_config->mosi_pin;
        nrf_gpio_pin_clear(mosi_pin);
        nrf_gpio_cfg_output(mosi_pin);
    } else {
        mosi_pin = NRF_SPI_PIN_NOT_CONNECTED;
    }

    /* - MISO (optional) - input*/
    if (p_config->miso_pin != NRF_DRV_SPI_PIN_NOT_USED) {
        miso_pin = p_config->miso_pin;
        nrf_gpio_cfg_input(miso_pin, NRF_GPIO_PIN_NOPULL);
    } else {
        miso_pin = NRF_SPI_PIN_NOT_CONNECTED;
    }
    p_spim = (NRF_SPIM_Type *)p_instance->p_registers;
    nrf_spim_pins_set(p_spim, p_config->sck_pin, mosi_pin, miso_pin);
    nrf_spim_frequency_set(p_spim, (nrf_spim_frequency_t)p_config->frequency);
    nrf_spim_orc_set(p_spim, p_config->orc);
    nrf_spim_configure(p_spim,
        (nrf_spim_mode_t)p_config->mode,
        (nrf_spim_bit_order_t)p_config->bit_order);
    nrf_spim_int_disable(p_spim, NRF_SPI_IRQ_DISABLE_ALL);
    NVIC_SetVector(p_instance->irq, (uint32_t)handler);
    nrf_drv_common_irq_enable(p_instance->irq, p_config->irq_priority);

    return NRF_SUCCESS;
}

static int
hal_spi_init_slave(nrf_drv_spis_t *p_instance,
                   nrf_drv_spis_config_t *p_config,
                   nrf_drv_irq_handler_t handler)
{
    uint32_t mosi_pin;
    uint32_t miso_pin;
    NRF_SPIS_Type *p_spis;

#if PERIPHERAL_RESOURCE_SHARING_ENABLED
    if (nrf_drv_common_per_res_acquire(p_instance->p_reg,
                                       handler) != NRF_SUCCESS) {
        return NRF_ERROR_BUSY;
    }
#endif

    if ((uint32_t)p_config->mode > (uint32_t)NRF_DRV_SPIS_MODE_3) {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (p_config->miso_pin != NRF_DRV_SPIS_PIN_NOT_USED) {
        nrf_gpio_cfg(p_config->miso_pin,
                    NRF_GPIO_PIN_DIR_INPUT,
                    NRF_GPIO_PIN_INPUT_CONNECT,
                    NRF_GPIO_PIN_NOPULL,
                    p_config->miso_drive,
                    NRF_GPIO_PIN_NOSENSE);
        miso_pin = p_config->miso_pin;
    } else {
        miso_pin = NRF_SPIS_PIN_NOT_CONNECTED;
    }

    if (p_config->mosi_pin != NRF_DRV_SPIS_PIN_NOT_USED) {
        nrf_gpio_cfg(p_config->mosi_pin,
                     NRF_GPIO_PIN_DIR_INPUT,
                     NRF_GPIO_PIN_INPUT_CONNECT,
                     NRF_GPIO_PIN_NOPULL,
                     NRF_GPIO_PIN_S0S1,
                     NRF_GPIO_PIN_NOSENSE);
        mosi_pin = p_config->mosi_pin;
    } else {
        mosi_pin = NRF_SPIS_PIN_NOT_CONNECTED;
    }

    nrf_gpio_cfg(p_config->csn_pin,
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_CONNECT,
                 p_config->csn_pullup,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);

    nrf_gpio_cfg(p_config->sck_pin,
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_CONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);

    p_spis = (NRF_SPIS_Type *)p_instance->p_reg;
    nrf_spis_pins_set(p_spis, p_config->sck_pin, mosi_pin, miso_pin, p_config->csn_pin);
    nrf_spis_configure(p_spis, (nrf_spis_mode_t) p_config->mode,
                               (nrf_spis_bit_order_t) p_config->bit_order);

    /* Configure DEF and ORC characters. */
    nrf_spis_def_set(p_spis, p_config->def);
    nrf_spis_orc_set(p_spis, p_config->orc);

