apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
    /* Disable interrupt and clear any interrupt events */
    nrf_spis_int_disable(p_spis, NRF_SPIS_INT_ACQUIRED_MASK | NRF_SPIS_INT_END_MASK);
    nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_END);
    nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_ACQUIRED);

    /* Enable END_ACQUIRE shortcut. */
    nrf_spis_shorts_enable(p_spis, NRF_SPIS_SHORT_END_ACQUIRE);
    NVIC_SetVector(p_instance->irq, (uint32_t)handler);
    nrf_drv_common_irq_enable(p_instance->irq, p_config->irq_priority);

    return NRF_SUCCESS;
}

/**
 * Initialize the SPI interface
 *
 *
 * @param spi_num
 * @param cfg
 * @param spi_type
 *
 * @return int
 */
int
hal_spi_init(int spi_num, void *cfg, uint8_t spi_type)
{
    int rc;
    struct nrf52_hal_spi *spi;
    nrf_drv_irq_handler_t irq_handler;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    /* Check for valid arguments */
    rc = EINVAL;
    if (cfg == NULL) {
        goto err;
    }

    if ((spi_type != HAL_SPI_TYPE_MASTER) && (spi_type != HAL_SPI_TYPE_SLAVE)) {
        goto err;
    }

    irq_handler = NULL;
    spi->spi_cfg.spi_type  = spi_type;
    if (spi_num == 0) {
#if SPI0_ENABLED
        irq_handler = nrf52_spi0_irq_handler;
        if (spi_type == HAL_SPI_TYPE_MASTER) {
            memcpy(&spi->nhs_spi.spim, &inst_spi0_m, sizeof(inst_spi0_m));
        } else {
            memcpy(&spi->nhs_spi.spis, &inst_spi0_s, sizeof(inst_spi0_s));
        }
#else
        goto err;
#endif
    } else if (spi_num == 1) {
#if SPI1_ENABLED
        irq_handler = nrf52_spi1_irq_handler;
        if (spi_type == HAL_SPI_TYPE_MASTER) {
            memcpy(&spi->nhs_spi.spim, &inst_spi1_m, sizeof(inst_spi0_m));
        } else {
            memcpy(&spi->nhs_spi.spis, &inst_spi1_s, sizeof(inst_spi0_s));
        }
#else
        goto err;
#endif
    } else {
        goto err;
    }

    if (spi_type == HAL_SPI_TYPE_MASTER) {
        rc = hal_spi_init_master(&spi->nhs_spi.spim,
                                 (nrf_drv_spi_config_t *)cfg,
                                 irq_handler);


    } else {
        rc = hal_spi_init_slave(&spi->nhs_spi.spis,
                                (nrf_drv_spis_config_t *)cfg,
                                irq_handler);
    }

err:
    return (rc);
}

int
hal_spi_config(int spi_num, struct hal_spi_settings *settings)
{
    int rc;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    spi->spi_cfg.txrx_cb_func = settings->txrx_cb_func;
    spi->spi_cfg.txrx_cb_arg = settings->txrx_cb_arg;

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        rc = hal_spi_config_master(spi, settings);
    } else {
        rc = hal_spi_config_slave(spi, settings);
    }

err:
    return (rc);
}

/**
 * Enables the SPI. This does not start a transmit or receive operation;
 * it is used for power mgmt. Cannot be called when a SPI transfer is in
 * progress.
 *
 * @param spi_num
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_enable(int spi_num)
{
    int rc;
    NRF_SPIS_Type *p_spis;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        p_spim = spi->nhs_spi.spim.p_registers;
        /* We need to enable this in blocking or non-blocking mode */
        if (spi->spi_cfg.txrx_cb_func) {
            nrf_spim_event_clear(p_spim, NRF_SPIM_INT_END_MASK);
            nrf_spim_int_enable(p_spim, NRF_SPIM_INT_END_MASK);
            nrf_spim_enable(p_spim);
        } else {
            nrf_spi_enable((NRF_SPI_Type *)p_spim);
        }
    } else {
        if (spi->spi_cfg.txrx_cb_func == NULL) {
            rc = EINVAL;
            goto err;
        }

        p_spis = spi->nhs_spi.spis.p_reg;
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_END);
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_ACQUIRED);
        nrf_spis_int_enable(p_spis, NRF_SPIS_INT_ACQUIRED_MASK | NRF_SPIS_INT_END_MASK);
        nrf_spis_enable(p_spis);
    }
    rc = 0;

err:
    return rc;
}

/**
 * Disables the SPI. Used for power mgmt. It will halt any current SPI transfers
 * in progress.
 *
 * @param spi_num
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_disable(int spi_num)
{
    int rc;
    NRF_SPIS_Type *p_spis;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        p_spim = spi->nhs_spi.spim.p_registers;
        nrf_spim_int_disable(p_spim, NRF_SPI_IRQ_DISABLE_ALL);
        if (spi->spi_xfr_flag) {
            hal_spi_stop_transfer(p_spim);
            spi->spi_xfr_flag = 0;
        }
        nrf_spim_disable(p_spim);
    } else {
        p_spis = spi->nhs_spi.spis.p_reg;
        nrf_spis_int_disable(p_spis, NRF_SPI_IRQ_DISABLE_ALL);
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_END);
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_ACQUIRED);
        nrf_spis_disable(p_spis);
        spi->slave_state = HAL_SPI_SLAVE_STATE_IDLE;
        spi->slave_txbuf = NULL;
        spi->slave_rxbuf = NULL;
    }
    rc = 0;

err:
    return rc;
}

/**
 * Blocking call to send a value on the SPI. Returns the value received from the
 * SPI.
 *
 * MASTER: Sends the value and returns the received value from the slave.
 * SLAVE: Sets the value to send to the master when the master transfers a
 *        value. This value will be sent until another call to hal_spi_tx_val()
 *        is made. The return code is ignored for a slave. 
 *
 * @param spi_num
 * @param val
 *
 * @return uint16_t Value received on SPI interface from slave. Returns 0xFFFF
 * if called when SPI configured as a Slave.
 */
uint16_t hal_spi_tx_val(int spi_num, uint16_t val)
{
    int rc;
    uint16_t retval;
    NRF_SPI_Type *p_spi;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        p_spi = (NRF_SPI_Type *) spi->nhs_spi.spim.p_registers;
        nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);
        nrf_spi_txd_set(p_spi, (uint8_t) val);
        while (!nrf_spi_event_check(p_spi, NRF_SPI_EVENT_READY)) {}
        nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);
        retval = (uint16_t)nrf_spi_rxd_get(p_spi);
    } else {
        retval = 0xFFFF;
    }

    return retval;

err:
    return rc;
}

/**
 * Sets the txrx callback (executed at interrupt context) when the
 * buffer is transferred by the master or the slave using the hal_spi_rxtx API.
 * This callback is also called when the SPI is a slave and chip select is
 * de-asserted and there is data available in the receive buffer.
 *
 * If the callback is NULL, the SPI will be in blocking mode; otherwise it is
 * in non-blocking mode.
 *
 * Cannot be called when the SPI is enabled.
 *
 * @param spi_num   SPI interface on which to set callback
 * @param txrx_cb   Pointer to callback function. NULL to set into blocking mode
 * @param arg       Argument passed to callback function.
 *
 * @return int 0 on success, -1 if spi is already enabled.
 */
int
hal_spi_set_txrx_cb(int spi_num, hal_spi_txrx_cb txrx_cb, void *arg)
{
    int rc;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

