apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
    /*
     * This looks odd, but the ENABLE register is in the same location for
     * SPIM, SPI and SPIS
     */
    p_spim = spi->nhs_spi.spim.p_registers;
    if (p_spim->ENABLE != 0) {
        rc = -1;
    } else {
        spi->spi_cfg.txrx_cb_func = txrx_cb;
        spi->spi_cfg.txrx_cb_arg = arg;
        rc = 0;
    }

err:
    return rc;
}

/**
 * Send a buffer and also store the received values. This call can be either
 * blocking or non-blocking for the master; it is always non-blocking for slave.
 * In non-blocking mode, the txrx callback is executed at interrupt context when
 * the buffer is sent.
 *     MASTER: master sends all the values in the buffer and stores the
 *             stores the values in the receive buffer if rxbuf is not NULL.
 *             The txbuf parameter cannot be NULL.
 *     SLAVE: Slave preloads the data to be sent to the master (values
 *            stored in txbuf) and places received data from master in rxbuf (if
 *            not NULL).  The txrx callback when len values are transferred or
 *            master de-asserts chip select. If txbuf is NULL, the slave
 *            transfers its default byte. Both rxbuf and txbuf cannot be NULL.
 *
 * @param spi_num   SPI interface to use
 * @param txbuf     Pointer to buffer where values to transmit are stored.
 * @param rxbuf     Pointer to buffer to store values received from peer. Can
 *                  be NULL.
 * @param len       Number of values to be transferred.
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_txrx(int spi_num, void *txbuf, void *rxbuf, int len)
{
    int i;
    int rc;
    int txcnt;
    uint8_t *txd, *rxd;
    uint8_t rxval;
    NRF_SPI_Type *p_spi;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    rc = EINVAL;
    if (!len || (len > 255)) {
        goto err;
    }

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        if (spi->spi_cfg.txrx_cb_func) {
            /* Must have a txbuf for master! */
            if (txbuf == NULL) {
                goto err;
            }

            /* Not allowed if transfer in progress */
            if (spi->spi_xfr_flag) {
                rc = -1;
                goto err;
            }

            p_spim = spi->nhs_spi.spim.p_registers;
            nrf_spim_tx_buffer_set(p_spim, txbuf, len);

            /* If no rxbuf, we need to set rxbuf and maxcnt to 1 */
            if (rxbuf == NULL) {
                nrf_spim_rx_buffer_set(p_spim, &spi->dummy_rx, 1);
            } else {
                nrf_spim_rx_buffer_set(p_spim, rxbuf, len);
            }

            nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_END);
            nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_STOPPED);

            nrf_spim_task_trigger(p_spim, NRF_SPIM_TASK_START);
            nrf_spim_int_enable(p_spim, NRF_SPIM_INT_END_MASK);
        } else {
            /* Blocking spi transfer */
            p_spi = (NRF_SPI_Type *) spi->nhs_spi.spim.p_registers;
            while (nrf_spi_event_check(p_spi, NRF_SPI_EVENT_READY)) {
                rxval = nrf_spi_rxd_get(p_spi);
                nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);
            }
            txd = (uint8_t *)txbuf;
            nrf_spi_txd_set(p_spi, *txd);
            txcnt = len - 1;
            rxd = (uint8_t *)rxbuf;
            for (i = 0; i < len; ++i) {
                if (txcnt) {
                    ++txd;
                    nrf_spi_txd_set(p_spi, *txd);
                    --txcnt;
                }
                while (!nrf_spi_event_check(p_spi, NRF_SPI_EVENT_READY)) {}
                nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);
                rxval = nrf_spi_rxd_get(p_spi);
                if (rxbuf) {
                    *rxd = rxval;
                    ++rxd;
                }
            }
        }
    } else {
        /* Must have txbuf and rxbuf */
        if ((txbuf == NULL) && (rxbuf == NULL)) {
            goto err;
        }

        /*
         * Ready the slave for a transfer. Do not allow this to be called
         * if the slave has already been readied or is requesting the
         * semaphore
         */
        if (spi->slave_state != HAL_SPI_SLAVE_STATE_IDLE) {
            rc = -1;
            goto err;
        }

        spi->slave_rxbuf = rxbuf;
        spi->slave_txbuf = txbuf;
        spi->slave_buflen = len;
        spi->slave_state = HAL_SPI_SLAVE_STATE_ACQ_SEM;
        nrf_spis_task_trigger(spi->nhs_spi.spis.p_reg, NRF_SPIS_TASK_ACQUIRE);
    }
    return 0;

err:
    return rc;
}

/**
 * Sets the default value transferred by the slave.
 *
 * @param spi_num SPI interface to use
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_slave_set_def_tx_val(int spi_num, uint16_t val)
{
    int rc;
    NRF_SPIS_Type *p_spis;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);
    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_SLAVE) {
        p_spis = spi->nhs_spi.spis.p_reg;
        nrf_spis_def_set(p_spis, (uint8_t) val);
        rc = 0;
    } else {
        rc = EINVAL;
    }

err:
    return rc;
}

/**
 * This aborts the current transfer but keeps the spi enabled. Should only
 * be used when the SPI is in non-blocking mode.
 *
 * @param spi_num   SPI interface on which transfer should be aborted.
 *
 * @return int 0 on success, non-zero error code on failure.
 *
 * NOTE: does not return an error if no transfer was in progress.
 */
int
hal_spi_abort(int spi_num)
{
    int rc;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    rc = 0;
    if (spi->spi_cfg.txrx_cb_func == NULL) {
        goto err;
    }

    if (spi->spi_cfg.spi_type  == HAL_SPI_TYPE_MASTER) {
        p_spim = spi->nhs_spi.spim.p_registers;
        if (spi->spi_xfr_flag) {
            nrf_spim_int_disable(p_spim, NRF_SPI_IRQ_DISABLE_ALL);
            hal_spi_stop_transfer(p_spim);
            spi->spi_xfr_flag = 0;
            nrf_spim_int_enable(p_spim, NRF_SPIM_INT_END_MASK);
        }
    } else {
        /* Only way I can see doing this is to disable, then re-enable */
        hal_spi_disable(spi_num);
        hal_spi_enable(spi_num);
    }

err:
    return rc;
}
